Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128S1.atdf
        <module name="SRAM1" id="1" version="1">
          <instance name="SRAM1">
            <parameters>
              <param name="INSTANCE_ID" value="91"/>
              <param name="CLOCK_ID" value="91"/>
            </parameters>
          </instance>
        </module>
        <module name="CoreDebug" version="1.0.0">
          <instance name="CoreDebug">
            <register-group name="CoreDebug" name-in-module="CoreDebug" address-space="base" offset="0xE000EDF0"/>
          </instance>
        </module>
        <module name="DWT" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
          </instance>
        </module>
        <module name="FPU" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
        </module>
        <module name="ITM" version="1.0.0">
          <instance name="ITM">
            <register-group name="ITM" name-in-module="ITM" address-space="base" offset="0xE0000000"/>
          </instance>
        </module>
        <module name="MPU" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="96" caption="Number of interrupt requests"/>
              <param name="__NVIC_PRIO_BITS" value="4" caption="Number of NVIC interrupt priority bits"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
          </instance>
        </module>
        <module name="TPI" version="1.0.0">
          <instance name="TPI">
            <register-group name="TPI" name-in-module="TPI" address-space="base" offset="0xE0040000"/>
            <signals>
              <signal pad="PB10" function="D" group="TRACESWO" index="0"/>
            </signals>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="DWDT" name="DWDT0" caption="Dual Watchdog 0 Timer"/>
        <interrupt index="5" module-instance="DWDT" name="DWDT1" caption="Dual Watchdog 1 Timer"/>
        <interrupt index="6" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="9" module-instance="FLEXCOM0" name="FLEXCOM0" caption="FLEXCOM 0 (USART0/SPI0/TWI0)"/>
        <interrupt index="10" module-instance="FLEXCOM1" name="FLEXCOM1" caption="FLEXCOM 1 (USART1/SPI1/TWI1)"/>
        <interrupt index="11" module-instance="FLEXCOM2" name="FLEXCOM2" caption="FLEXCOM 2 (USART2/SPI2/TWI2)"/>
        <interrupt index="12" module-instance="FLEXCOM3" name="FLEXCOM3" caption="FLEXCOM 3 (USART3/SPI3/TWI3)"/>
        <interrupt index="13" module-instance="FLEXCOM4" name="FLEXCOM4" caption="FLEXCOM 4 (USART4/SPI4/TWI4)"/>
        <interrupt index="14" module-instance="FLEXCOM5" name="FLEXCOM5" caption="FLEXCOM 5 (USART5/SPI5/TWI5)"/>
        <interrupt index="15" module-instance="FLEXCOM6" name="FLEXCOM6" caption="FLEXCOM 6 (USART6/SPI6/TWI6)"/>
        <interrupt index="16" module-instance="FLEXCOM7" name="FLEXCOM7" caption="FLEXCOM 7 (USART7/SPI7/TWI7)"/>
        <interrupt index="17" module-instance="PIOA" name="PIOA" caption="Application Core Parallel I/O Controller A (PIOA)"/>
        <interrupt index="18" module-instance="PIOA" name="PIOA_SEC" caption="Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt"/>
        <interrupt index="19" module-instance="PIOB" name="PIOB" caption="Application Core Parallel I/O Controller B (PIOB)"/>
        <interrupt index="20" module-instance="PIOB" name="PIOB_SEC" caption="Application Core Parallel I/O Controller B (PIOB) Secure Event Interrupt"/>
        <interrupt index="21" module-instance="PIOC" name="PIOC" caption="Application Core Parallel I/O Controller C (PIOC)"/>
        <interrupt index="22" module-instance="PIOC" name="PIOC_SEC" caption="Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt"/>
        <interrupt index="23" module-instance="QSPI" name="QSPI" caption="Quad IO Serial Peripheral Interface"/>
        <interrupt index="24" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
        <interrupt index="25" module-instance="ACC" name="ACC" caption="Analog Comparator"/>
        <interrupt index="28" module-instance="IPC0" name="IPC0" caption="Application Core Interprocessor communication (IPC0)"/>
        <interrupt index="29" module-instance="SLCDC" name="SLCDC" caption="Segment LCD Controller"/>
        <interrupt index="30" module-instance="MEM2MEM0" name="MEM2MEM0" caption="Application Core Memory to Memory Transfer Controller (MEM2MEM0)"/>
        <interrupt index="31" module-instance="TC0" name="TC0_CHANNEL0" header:alternate-name="TC0_CH0" caption="Timer Counter 0, Channel 0"/>
        <interrupt index="32" module-instance="TC0" name="TC0_CHANNEL1" header:alternate-name="TC0_CH1" caption="Timer Counter 0, Channel 1"/>
        <interrupt index="33" module-instance="TC0" name="TC0_CHANNEL2" header:alternate-name="TC0_CH2" caption="Timer Counter 0, Channel 2"/>
        <interrupt index="34" module-instance="TC1" name="TC1_CHANNEL0" header:alternate-name="TC1_CH0" caption="Timer Counter 1, Channel 0"/>
        <interrupt index="35" module-instance="TC1" name="TC1_CHANNEL1" header:alternate-name="TC1_CH1" caption="Timer Counter 1, Channel 1"/>
        <interrupt index="36" module-instance="TC1" name="TC1_CHANNEL2" header:alternate-name="TC1_CH2" caption="Timer Counter 1, Channel 2"/>
        <interrupt index="37" module-instance="TC2" name="TC2_CHANNEL0" header:alternate-name="TC2_CH0" caption="Timer Counter 2, Channel 0"/>
        <interrupt index="38" module-instance="TC2" name="TC2_CHANNEL1" header:alternate-name="TC2_CH1" caption="Timer Counter 2, Channel 1"/>
        <interrupt index="39" module-instance="TC2" name="TC2_CHANNEL2" header:alternate-name="TC2_CH2" caption="Timer Counter 2, Channel 2"/>
        <interrupt index="40" module-instance="TC0" name="TC0_C0SEC" caption="Timer Counter 0, Channel 0, Secure IRQ"/>
        <interrupt index="41" module-instance="TC0" name="TC0_C1SEC" caption="Timer Counter 0, Channel 1, Secure IRQ"/>
        <interrupt index="42" module-instance="TC0" name="TC0_C2SEC" caption="Timer Counter 0, Channel 2, Secure IRQ"/>
        <interrupt index="43" module-instance="TC1" name="TC1_C0SEC" caption="Timer Counter 1, Channel 0, Secure IRQ"/>
        <interrupt index="44" module-instance="TC1" name="TC1_C1SEC" caption="Timer Counter 1, Channel 1, Secure IRQ"/>
        <interrupt index="45" module-instance="TC1" name="TC1_C2SEC" caption="Timer Counter 1, Channel 2, Secure IRQ"/>
        <interrupt index="46" module-instance="TC2" name="TC2_C0SEC" caption="Timer Counter 2, Channel 0, Secure IRQ"/>
        <interrupt index="47" module-instance="TC2" name="TC2_C1SEC" caption="Timer Counter 2, Channel 1, Secure IRQ"/>
        <interrupt index="48" module-instance="TC2" name="TC2_C2SEC" caption="Timer Counter 2, Channel 2, Secure IRQ"/>
        <interrupt index="61" module-instance="MATRIX1" name="MATRIX1" caption="Low-Speed Application Core Matrix (LSACM) (MATRIX1)"/>
        <interrupt index="62" module-instance="SUPC" name="SUPC_WKUP3" caption="External interrupt 3"/>
        <interrupt index="63" module-instance="SUPC" name="SUPC_WKUP4" caption="External interrupt 4"/>
        <interrupt index="64" module-instance="SUPC" name="SUPC_WKUP5" caption="External interrupt 5"/>
        <interrupt index="65" module-instance="SUPC" name="SUPC_WKUP6" caption="External interrupt 6"/>
        <interrupt index="66" module-instance="SUPC" name="SUPC_WKUP7" caption="External interrupt 7"/>
        <interrupt index="67" module-instance="SUPC" name="SUPC_WKUP8" caption="External interrupt 8"/>
        <interrupt index="68" module-instance="SUPC" name="SUPC_WKUP9" caption="External interrupt 9"/>
        <interrupt index="69" module-instance="SUPC" name="SUPC_WKUP10" caption="External interrupt 10"/>
        <interrupt index="70" module-instance="SUPC" name="SUPC_WKUP11" caption="External interrupt 11"/>
        <interrupt index="71" module-instance="SUPC" name="SUPC_WKUP12" caption="External interrupt 12"/>
        <interrupt index="72" module-instance="SUPC" name="SUPC_WKUP13" caption="External interrupt 13"/>
        <interrupt index="73" module-instance="SUPC" name="SUPC_WKUP14" caption="External interrupt 14"/>
        <interrupt index="74" module-instance="SUPC" name="SUPC_WKUP15" caption="External interrupt 15"/>
        <interrupt index="78" module-instance="MEM2MEM1" name="MEM2MEM1" caption="Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1)"/>
        <interrupt index="79" module-instance="TC3" name="TC3_CHANNEL0" caption="Timer Counter 3, Channel 0"/>
        <interrupt index="80" module-instance="TC3" name="TC3_CHANNEL1" caption="Timer Counter 3, Channel 1"/>
        <interrupt index="81" module-instance="TC3" name="TC3_CHANNEL2" caption="Timer Counter 3, Channel 2"/>
        <interrupt index="82" module-instance="TC3" name="TC3_C0SEC" caption="Timer Counter 3, Channel 0, Secure IRQ"/>
        <interrupt index="83" module-instance="TC3" name="TC3_C1SEC" caption="Timer Counter 3, Channel 1, Secure IRQ"/>
        <interrupt index="84" module-instance="TC3" name="TC3_C2SEC" caption="Timer Counter 3, Channel 2, Secure IRQ"/>
        <interrupt index="85" module-instance="PIOD" name="PIOD" caption="Metrology Core Parallel I/O Controller D (PIOD)"/>
        <interrupt index="86" module-instance="PIOD" name="PIOD_SEC" caption="Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD)"/>
        <interrupt index="87" module-instance="UART" name="UART" caption="Optical UART"/>
        <interrupt index="88" module-instance="IPC1" name="IPC1" caption="Metrology Core Interprocessor communication (IPC1)"/>
        <interrupt index="89" module-instance="MCSPI" name="MCSPI" caption="Multi-Channel SPI"/>
        <interrupt index="90" module-instance="PWM" name="PWM" caption="Pulse Width Modulation"/>
        <interrupt index="94" module-instance="MATRIX2" name="MATRIX2" caption="High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2)"/>
        <interrupt index="95" module-instance="MATRIX3" name="MATRIX3" caption="Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3)"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="JTAGID" value="0x05B4503F"/>
          <property name="CHIPID_CIDR" value="0x2C5D0CE0"/>
          <property name="CHIPID_EXID" value="0x00000000"/>
        </property-group>
      </property-groups>
      <parameters>
        <param name="__CM4_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="1"/>
        <param name="__FPU_PRESENT" value="1"/>
        <param name="__NVIC_PRIO_BITS" value="4"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
    </device>
  </devices>
  <modules>
    <module caption="Analog Comparator Controller" name="ACC" id="04597" version="C">
      <register-group name="ACC">
        <register caption="Control Register" name="ACC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="ACC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Selection for Minus Comparator Input" mask="0x00000007" name="SELMINUS" values="ACC_MR__SELMINUS"/>
          <bitfield caption="Selection For Plus Comparator Input" mask="0x00000070" name="SELPLUS" values="ACC_MR__SELPLUS"/>
          <bitfield caption="Analog Comparator Enable" mask="0x00000100" name="ACEN" values="ACC_MR__ACEN"/>
          <bitfield caption="Edge Type" mask="0x00000600" name="EDGETYP" values="ACC_MR__EDGETYP"/>
          <bitfield caption="Invert Comparator Output" mask="0x00001000" name="INV" values="ACC_MR__INV"/>
          <bitfield caption="Selection Of Fault Source" mask="0x00002000" name="SELFS" values="ACC_MR__SELFS"/>
          <bitfield caption="Fault Enable" mask="0x00004000" name="FE" values="ACC_MR__FE"/>
        </register>
        <register caption="Interrupt Enable Register" name="ACC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
        <register caption="Interrupt Disable Register" name="ACC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Comparison Edge" mask="0x00000001" name="CE"/>
        </register>
