Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128S1.atdf
      <value-group caption="External Clock Selection" name="ADC_EMR__SRCCLK">
        <value caption="The peripheral clock is the source for the ADC prescaler." name="PERIPH_CLK" value="0"/>
        <value caption="GCLK is the source clock for the ADC prescaler, thus the ADC clock can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Tracking Time x4, x8 or x16" name="ADC_EMR__TRACKX">
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 1." name="TRACKTIMX1" value="0x0"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 4." name="TRACKTIMX4" value="0x1"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 8" name="TRACKTIMX8" value="0x2"/>
        <value caption="ADC_MR.TRACKTIM effect is multiplied by 16." name="TRACKTIMX16" value="0x3"/>
      </value-group>
      <value-group caption="Sign Mode" name="ADC_EMR__SIGNMODE">
        <value caption="Single-ended channels: unsigned conversions Differential channels: signed conversions" name="SE_UNSG_DF_SIGN" value="0x0"/>
        <value caption="Single-ended channels: signed conversions Differential channels: unsigned conversions" name="SE_SIGN_DF_UNSG" value="0x1"/>
        <value caption="All channels: unsigned conversions" name="ALL_UNSIGNED" value="0x2"/>
        <value caption="All channels: signed conversions" name="ALL_SIGNED" value="0x3"/>
      </value-group>
      <value-group caption="ADC Running Mode" name="ADC_EMR__ADCMODE">
        <value caption="Normal mode of operation." name="NORMAL" value="0x0"/>
        <value caption="Offset Error mode to measure the offset error. See Table 6-6 &quot;ADC Running Modes&quot;." name="OFFSET_ERROR" value="0x1"/>
        <value caption="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." name="GAIN_ERROR_HIGH" value="0x2"/>
        <value caption="Gain Error mode to measure the gain error. See Table 6-6 &quot;ADC Running Modes&quot;." name="GAIN_ERROR_LOW" value="0x3"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_PWPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation. Always reads as 0." name="PASSWD" value="0x504443"/>
      </value-group>
      <value-group name="ADC_FMR__ENFIFO">
        <value name="0" caption="FIFO is disabled." value="0"/>
        <value name="1" caption="FIFO is enabled." value="1"/>
      </value-group>
      <value-group name="ADC_FMR__ENLEVEL">
        <value name="0" caption="Request to DMA is generated as soon as one data is written in FIFO when FIFO is enabled. CHUNK is not used." value="0"/>
        <value name="1" caption="Request to DMA is generated as soon as the number of written elements in the FIFO is greater than or equal to CHUNK." value="1"/>
      </value-group>
      <value-group caption="Trigger Mode" name="ADC_TRGR__TRGMOD">
        <value caption="No hardware trigger, only software trigger can start conversions" name="NO_TRIGGER" value="0x0"/>
        <value caption="Rising edge of the selected trigger event, defined in ADC_MR.TRGSEL" name="EXT_TRIG_RISE" value="0x1"/>
        <value caption="Falling edge of the selected trigger event" name="EXT_TRIG_FALL" value="0x2"/>
        <value caption="Any edge of the selected trigger event" name="EXT_TRIG_ANY" value="0x3"/>
        <value caption="ADC internal periodic trigger (see TRGPER)" name="PERIOD_TRIG" value="0x5"/>
        <value caption="Continuous mode, free run mode" name="CONTINUOUS" value="0x6"/>
      </value-group>
      <value-group caption="Write Protection Key" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Chip Identifier" name="CHIPID" id="6417" version="ZW">
      <register-group name="CHIPID">
        <register caption="Chip ID Register" name="CHIPID_CIDR" offset="0x0" rw="R" size="4">
          <bitfield caption="Version of the Device" mask="0x0000001F" name="VERSION"/>
          <bitfield caption="Embedded Processor" mask="0x000000E0" name="EPROC" values="CHIPID_CIDR__EPROC"/>
          <bitfield caption="Nonvolatile Program Memory Size" mask="0x00000F00" name="NVPSIZ" values="CHIPID_CIDR__NVPSIZ"/>
          <bitfield caption="Second Nonvolatile Program Memory Size" mask="0x0000F000" name="NVPSIZ2" values="CHIPID_CIDR__NVPSIZ2"/>
          <bitfield caption="Internal SRAM Size" mask="0x000F0000" name="SRAMSIZ" values="CHIPID_CIDR__SRAMSIZ"/>
          <bitfield caption="Architecture Identifier" mask="0x0FF00000" name="ARCH" values="CHIPID_CIDR__ARCH"/>
          <bitfield caption="Nonvolatile Program Memory Type" mask="0x70000000" name="NVPTYP" values="CHIPID_CIDR__NVPTYP"/>
          <bitfield caption="Extension Flag" mask="0x80000000" name="EXT"/>
        </register>
        <register caption="Chip ID Extension Register" name="CHIPID_EXID" offset="0x4" rw="R" size="4">
          <bitfield caption="Chip ID Extension" mask="0xFFFFFFFF" name="EXID"/>
        </register>
      </register-group>
      <value-group caption="Embedded Processor" name="CHIPID_CIDR__EPROC">
        <value caption="Cortex-M7" name="SAMx7" value="0x0"/>
        <value caption="ARM946ES" name="ARM946ES" value="0x1"/>
        <value caption="ARM7TDMI" name="ARM7TDMI" value="0x2"/>
        <value caption="Cortex-M3" name="CM3" value="0x3"/>
        <value caption="ARM920T" name="ARM920T" value="0x4"/>
        <value caption="ARM926EJS" name="ARM926EJS" value="0x5"/>
        <value caption="Cortex-A5" name="CA5" value="0x6"/>
        <value caption="Cortex-M4" name="CM4" value="0x7"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="160 Kbytes" name="_160K" value="0x8"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Second Nonvolatile Program Memory Size" name="CHIPID_CIDR__NVPSIZ2">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="8 Kbytes" name="_8K" value="0x1"/>
        <value caption="16 Kbytes" name="_16K" value="0x2"/>
        <value caption="32 Kbytes" name="_32K" value="0x3"/>
        <value caption="64 Kbytes" name="_64K" value="0x5"/>
        <value caption="128 Kbytes" name="_128K" value="0x7"/>
        <value caption="256 Kbytes" name="_256K" value="0x9"/>
        <value caption="512 Kbytes" name="_512K" value="0xA"/>
        <value caption="1024 Kbytes" name="_1024K" value="0xC"/>
        <value caption="2048 Kbytes" name="_2048K" value="0xE"/>
      </value-group>
      <value-group caption="Internal SRAM Size" name="CHIPID_CIDR__SRAMSIZ">
        <value caption="48 Kbytes" name="_48K" value="0x0"/>
        <value caption="192 Kbytes" name="_192K" value="0x1"/>
        <value caption="384 Kbytes" name="_384K" value="0x2"/>
        <value caption="6 Kbytes" name="_6K" value="0x3"/>
        <value caption="24 Kbytes" name="_24K" value="0x4"/>
        <value caption="4 Kbytes" name="_4K" value="0x5"/>
        <value caption="80 Kbytes" name="_80K" value="0x6"/>
        <value caption="160 Kbytes" name="_160K" value="0x7"/>
        <value caption="8 Kbytes" name="_8K" value="0x8"/>
        <value caption="16 Kbytes" name="_16K" value="0x9"/>
        <value caption="32 Kbytes" name="_32K" value="0xA"/>
        <value caption="64 Kbytes" name="_64K" value="0xB"/>
        <value caption="128 Kbytes" name="_128K" value="0xC"/>
        <value caption="256 Kbytes" name="_256K" value="0xD"/>
        <value caption="96 Kbytes" name="_96K" value="0xE"/>
        <value caption="512 Kbytes" name="_512K" value="0xF"/>
      </value-group>
      <value-group caption="Architecture Identifier" name="CHIPID_CIDR__ARCH">
        <value caption="Dual Core, Single Phase, High Accuracy (128-lead version)" name="PIC32CXMTSH128" value="0xC3"/>
        <value caption="Dual Core (128-lead version)" name="PIC32CXMTC128" value="0xC5"/>
        <value caption="Single Core (64-lead version)" name="PIC32CXMTG64" value="0xC6"/>
        <value caption="Single Core (128-lead version)" name="PIC32CXMTG128" value="0xC8"/>
      </value-group>
      <value-group caption="Nonvolatile Program Memory Type" name="CHIPID_CIDR__NVPTYP">
        <value caption="ROM" name="ROM" value="0x0"/>
        <value caption="ROMless or on-chip Flash" name="ROMLESS" value="0x1"/>
        <value caption="Embedded Flash Memory" name="FLASH" value="0x2"/>
        <value caption="ROM and Embedded Flash Memory - NVPSIZ is ROM size - NVPSIZ2 is Flash size" name="ROM_FLASH" value="0x3"/>
        <value caption="SRAM emulating ROM" name="SRAM" value="0x4"/>
      </value-group>
    </module>
    <module caption="Dual Watchdog Timer" name="DWDT" id="04686" version="C">
      <register-group name="DWDT">
        <register caption="Watchdog 1 Control Register" name="WDT1_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Watchdog Restart" mask="0x00000001" name="WDRSTT"/>
          <bitfield caption="Lock Mode Register Write Access" mask="0x00000010" name="LOCKMR"/>
          <bitfield caption="Password" mask="0xFF000000" name="KEY" values="WDT1_CR__KEY"/>
        </register>
        <register caption="Watchdog 1 Mode Register" name="WDT1_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Watchdog Overflow Period Reset Enable" mask="0x00000010" name="PERIODRST"/>
          <bitfield caption="Repeat Threshold Reset Enable" mask="0x00000020" name="RPTHRST"/>
          <bitfield caption="Watchdog Reset NRST Pin Disable" mask="0x00000200" name="WDNRSTDIS"/>
          <bitfield caption="Watchdog Disable" mask="0x00001000" name="WDDIS"/>
          <bitfield caption="Watchdog Idle Halt" mask="0x10000000" name="WDIDLEHLT"/>
          <bitfield caption="Watchdog Core 0 Debug Halt" mask="0x20000000" name="WDDBG0HLT"/>
          <bitfield caption="Watchdog Core 1 Debug Halt" mask="0x40000000" name="WDDBG1HLT"/>
        </register>
        <register caption="Watchdog 1 Value Register" name="WDT1_VR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Watchdog Down Counter Value" mask="0x00000FFF" name="COUNTER"/>
        </register>
