Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128S1.atdf
        <register caption="CRC Register" name="MCSPI_CRCR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Frame Length" mask="0x000000FF" name="FRL"/>
          <bitfield caption="CRC Size" mask="0x00010000" name="CRCS" values="MCSPI_CRCR__CRCS"/>
          <bitfield caption="Frame Header Length" mask="0x00F00000" name="FRHL"/>
          <bitfield caption="Continuous Read Mode" mask="0x01000000" name="CRM"/>
          <bitfield caption="Frame Header Excluded" mask="0x02000000" name="FHE"/>
          <bitfield caption="Disable CRC Receiving" mask="0x04000000" name="DCRX"/>
          <bitfield caption="Disable Header Receiving" mask="0x08000000" name="DHRX"/>
        </register>
        <register caption="Two-Pin Mode Register" name="MCSPI_TPMR" offset="0x50" rw="RW" size="4">
          <bitfield caption="Chip Select Mode" mask="0x00000001" name="CSM"/>
          <bitfield caption="Multiple Input Lines" mask="0x00000002" name="MIL"/>
          <bitfield caption="OverSampling Rate" mask="0x0000000C" name="OSR"/>
        </register>
        <register caption="Two-Pin Header Register" name="MCSPI_TPHR" offset="0x54" rw="R" size="4">
          <bitfield caption="Frame Counter" mask="0x00000003" name="CNT"/>
          <bitfield caption="Current Boost" mask="0x00000004" name="BOOST"/>
          <bitfield caption="Gain" mask="0x00000018" name="GAIN"/>
          <bitfield caption="OverSampling Rate" mask="0x00000060" name="OSR"/>
        </register>
        <register caption="Write Protection Mode Register" name="MCSPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MCSPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="MCSPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="MCSPI_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="MCSPI_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="MCSPI_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="MCSPI_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="MCSPI_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="MCSPI_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="MCSPI_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="MCSPI_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="MCSPI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="MCSPI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
        <register caption="Write Protection Mode Register" name="MCSPI_PWPMR" offset="0x128" rw="RW" size="4">
          <bitfield caption="Write Protection Pointer Registers Enable" mask="0x00000001" name="WPPTREN"/>
          <bitfield caption="Write Protection Counter Registers Enable" mask="0x00000002" name="WPCTREN"/>
          <bitfield caption="Write Protection Control Register Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="MCSPI_PWPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Bit Rate Source Clock" name="MCSPI_MR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="PMC GCLK is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="GCLK" value="1"/>
      </value-group>
      <value-group caption="Two-pin MOSI Chip Select External Multiplexing Mode" name="MCSPI_MR__TMCSMUX">
        <value caption="External MOSI lines multiplexing is not required via Chip Select lines. When MCSPI_MR.TPMEN=0, MCSPI_TWMR.MIL=1 or MCSPI_TWMR.CSM=0, TMCSMUX must be written to 0." name="DISABLED" value="0"/>
        <value caption="Enables external multiplexing of MOSI lines via Chip Select lines. When MCSPI_MR.TPMEN=1, TMCSMUX must be written to 1 if MCSPI_TWMR.MIL=0 and MCSPI_TWMR.CSM=1." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Comparison Mode" name="MCSPI_MR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception of all incoming characters until REQCLR is set." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="Bits Per Transfer" name="MCSPI_CSR__BITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="9 bits for transfer" name="_9_BIT" value="0x1"/>
        <value caption="10 bits for transfer" name="_10_BIT" value="0x2"/>
        <value caption="11 bits for transfer" name="_11_BIT" value="0x3"/>
        <value caption="12 bits for transfer" name="_12_BIT" value="0x4"/>
        <value caption="13 bits for transfer" name="_13_BIT" value="0x5"/>
        <value caption="14 bits for transfer" name="_14_BIT" value="0x6"/>
        <value caption="15 bits for transfer" name="_15_BIT" value="0x7"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="Transmit Data Register Empty Mode" name="MCSPI_FMR__TXRDYM">
        <value caption="TDRE will be at level '1' when at least one data can be written in the Transmit FIFO." name="ONE_DATA" value="0"/>
        <value caption="TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if MCSPI_MR.PS =1." name="TWO_DATA" value="1"/>
      </value-group>
      <value-group caption="Receive Data Register Full Mode" name="MCSPI_FMR__RXRDYM">
        <value caption="RDRF will be at level '1' when at least one unread data is in the Receive FIFO." name="ONE_DATA" value="0x0"/>
        <value caption="RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used when MCSPI_MR.MSTR =1, or if MCSPI_MR.PS =1." name="TWO_DATA" value="0x1"/>
        <value caption="RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when MCSPI_CSRx.BITS is greater than 0, or if MCSPI_MR.MSTR = 1, or if MCSPI_MR.PS = 1." name="FOUR_DATA" value="0x2"/>
      </value-group>
      <value-group caption="CRC Size" name="MCSPI_CRCR__CRCS">
        <value caption="CRC size is 16 bits." name="_16B_CRC" value="0"/>
        <value caption="CRC size is 32 bits." name="_32B_CRC" value="1"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MCSPI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of WPEN. Always reads as 0." name="PASSWD" value="0x535049"/>
      </value-group>
