Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX1025MTC128S1.atdf
    <module caption="Timer Counter" name="TC" id="44162" version="D">
      <register-group name="TC_CHANNEL" size="64">
        <register caption="Channel Control Register" name="TC_CCR" offset="0x0" rw="W" size="4">
          <bitfield caption="Counter Clock Enable Command" mask="0x00000001" name="CLKEN"/>
          <bitfield caption="Counter Clock Disable Command" mask="0x00000002" name="CLKDIS"/>
          <bitfield caption="Software Trigger Command" mask="0x00000004" name="SWTRG"/>
        </register>
        <register caption="Channel Mode Register" name="TC_CMR" offset="0x4" rw="RW" size="4">
          <mode name="CAPTURE"/>
          <mode name="WAVEFORM"/>
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR__TCCLKS" modes="CAPTURE"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI" modes="CAPTURE"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR__BURST" modes="CAPTURE"/>
          <bitfield caption="Counter Clock Stopped with RB Loading" mask="0x00000040" name="LDBSTOP" modes="CAPTURE"/>
          <bitfield caption="Counter Clock Disable with RB Loading" mask="0x00000080" name="LDBDIS" modes="CAPTURE"/>
          <bitfield caption="External Trigger Edge Selection" mask="0x00000300" name="ETRGEDG" values="TC_CMR__ETRGEDG" modes="CAPTURE"/>
          <bitfield caption="TIOAx or TIOBx External Trigger Selection" mask="0x00000400" name="ABETRG" modes="CAPTURE"/>
          <bitfield caption="RC Compare Trigger Enable" mask="0x00004000" name="CPCTRG" modes="CAPTURE"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE" modes="CAPTURE"/>
          <bitfield caption="RA Loading Edge Selection" mask="0x00030000" name="LDRA" values="TC_CMR__LDRA" modes="CAPTURE"/>
          <bitfield caption="RB Loading Edge Selection" mask="0x000C0000" name="LDRB" values="TC_CMR__LDRB" modes="CAPTURE"/>
          <bitfield caption="Loading Edge Subsampling Ratio" mask="0x00700000" name="SBSMPLR" values="TC_CMR__SBSMPLR" modes="CAPTURE"/>
          <bitfield caption="Clock Selection" mask="0x00000007" name="TCCLKS" values="TC_CMR__TCCLKS" modes="WAVEFORM"/>
          <bitfield caption="Clock Invert" mask="0x00000008" name="CLKI" modes="WAVEFORM"/>
          <bitfield caption="Burst Signal Selection" mask="0x00000030" name="BURST" values="TC_CMR__BURST" modes="WAVEFORM"/>
          <bitfield caption="Counter Clock Stopped with RC Compare" mask="0x00000040" name="CPCSTOP" modes="WAVEFORM"/>
          <bitfield caption="Counter Clock Disable with RC Compare" mask="0x00000080" name="CPCDIS" modes="WAVEFORM"/>
          <bitfield caption="External Event Edge Selection" mask="0x00000300" name="EEVTEDG" values="TC_CMR__EEVTEDG" modes="WAVEFORM"/>
          <bitfield caption="External Event Selection" mask="0x00000C00" name="EEVT" values="TC_CMR__EEVT" modes="WAVEFORM"/>
          <bitfield caption="External Event Trigger Enable" mask="0x00001000" name="ENETRG" modes="WAVEFORM"/>
          <bitfield caption="Waveform Selection" mask="0x00006000" name="WAVSEL" values="TC_CMR__WAVSEL" modes="WAVEFORM"/>
          <bitfield caption="Waveform Mode" mask="0x00008000" name="WAVE"/>
          <bitfield caption="RA Compare Effect on TIOAx" mask="0x00030000" name="ACPA" values="TC_CMR__ACPA" modes="WAVEFORM"/>
          <bitfield caption="RC Compare Effect on TIOAx" mask="0x000C0000" name="ACPC" values="TC_CMR__ACPC" modes="WAVEFORM"/>
          <bitfield caption="External Event Effect on TIOAx" mask="0x00300000" name="AEEVT" values="TC_CMR__AEEVT" modes="WAVEFORM"/>
          <bitfield caption="Software Trigger Effect on TIOAx" mask="0x00C00000" name="ASWTRG" values="TC_CMR__ASWTRG" modes="WAVEFORM"/>
          <bitfield caption="RB Compare Effect on TIOBx" mask="0x03000000" name="BCPB" values="TC_CMR__BCPB" modes="WAVEFORM"/>
          <bitfield caption="RC Compare Effect on TIOBx" mask="0x0C000000" name="BCPC" values="TC_CMR__BCPC" modes="WAVEFORM"/>
          <bitfield caption="External Event Effect on TIOBx" mask="0x30000000" name="BEEVT" values="TC_CMR__BEEVT" modes="WAVEFORM"/>
          <bitfield caption="Software Trigger Effect on TIOBx" mask="0xC0000000" name="BSWTRG" values="TC_CMR__BSWTRG" modes="WAVEFORM"/>
        </register>
        <register caption="Stepper Motor Mode Register" name="TC_SMMR" offset="0x8" rw="RW" size="4">
          <bitfield caption="Gray Count Enable" mask="0x00000001" name="GCEN"/>
          <bitfield caption="Down Count" mask="0x00000002" name="DOWN"/>
        </register>
        <register caption="Counter Value" name="TC_CV" offset="0x10" rw="R" size="4">
          <bitfield caption="Counter Value" mask="0xFFFFFFFF" name="CV"/>
        </register>
        <register caption="Register A" name="TC_RA" offset="0x14" rw="RW" size="4">
          <bitfield caption="Register A" mask="0xFFFFFFFF" name="RA"/>
        </register>
        <register caption="Register B" name="TC_RB" offset="0x18" rw="RW" size="4">
          <bitfield caption="Register B" mask="0xFFFFFFFF" name="RB"/>
        </register>
        <register caption="Register C" name="TC_RC" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Register C" mask="0xFFFFFFFF" name="RC"/>
        </register>
        <register caption="Interrupt Status Register" name="TC_SR" offset="0x20" rw="R" size="4">
          <bitfield caption="Counter Overflow Status (cleared on read)" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun Status (cleared on read)" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare Status (cleared on read)" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare Status (cleared on read)" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare Status (cleared on read)" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading Status (cleared on read)" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading Status (cleared on read)" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger Status (cleared on read)" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full (cleared by writing TC_RCR or TC_RNCR)" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Security and/or Safety Event (cleared on read)" mask="0x00000400" name="SECE"/>
          <bitfield caption="Clock Enabling Status" mask="0x00010000" name="CLKSTA"/>
          <bitfield caption="TIOAx Mirror" mask="0x00020000" name="MTIOA"/>
          <bitfield caption="TIOBx Mirror" mask="0x00040000" name="MTIOB"/>
        </register>
        <register caption="Interrupt Enable Register" name="TC_IER" offset="0x24" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Enable" mask="0x00000400" name="SECE"/>
        </register>
        <register caption="Interrupt Disable Register" name="TC_IDR" offset="0x28" rw="W" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Disable" mask="0x00000400" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="TC_IMR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Counter Overflow" mask="0x00000001" name="COVFS"/>
          <bitfield caption="Load Overrun" mask="0x00000002" name="LOVRS"/>
          <bitfield caption="RA Compare" mask="0x00000004" name="CPAS"/>
          <bitfield caption="RB Compare" mask="0x00000008" name="CPBS"/>
          <bitfield caption="RC Compare" mask="0x00000010" name="CPCS"/>
          <bitfield caption="RA Loading" mask="0x00000020" name="LDRAS"/>
          <bitfield caption="RB Loading" mask="0x00000040" name="LDRBS"/>
          <bitfield caption="External Trigger" mask="0x00000080" name="ETRGS"/>
          <bitfield caption="End of Receiver Transfer" mask="0x00000100" name="ENDRX"/>
          <bitfield caption="Reception Buffer Full" mask="0x00000200" name="RXBUFF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Mask" mask="0x00000400" name="SECE"/>
        </register>
